# Brewfile

####= SuitAndCape Homebrew Formulae
##============================================================================##

## Homebrew Taps
tap 'caskroom/versions'
tap 'homebrew/completions'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/versions'

## Homebrew development Casks
cask 'xquartz'

## Homebrew development Formulae
brew 'cairo'
brew 'cmake'
brew 'freetype'
brew 'gcc'
brew 'gdbm'
brew 'giflib'
brew 'git'
brew 'go'
brew 'graphviz', args: ['with-app', 'with-librsvg', 'with-x11']
brew 'heroku'
brew 'icu4c'
brew 'imagemagick', args: ['with-fftw', 'with-librsvg', 'with-little-cms2', 'with-webp', 'with-x11']
brew 'libffi'
brew 'libjpeg'
brew 'libpng'
brew 'libtiff'
brew 'libxml2'
brew 'libyaml'
brew 'little-cms2'
brew 'lua'
brew 'node', args: ['without-npm']
brew 'openssl'
brew 'p7zip'
brew 'qt'
brew 'readline'
brew 'scons'
brew 'swig'
brew 'unrar'
brew 'xz'
brew 'zeromq'

## Homebrew shell Formulae
brew 'ack'
brew 'bash'
brew 'coreutils'
brew 'findutils'
brew 'gnu-sed', args: ['with-default-names']
brew 'moreutils'
brew 'most'
brew 'tmux'
brew 'tree'
brew 'vim'#, args: ['python3']
brew 'zsh'
## Tapped "dupes" Formulae
brew 'grep'
brew 'nano'
brew 'openssh'
## Tapped "completions" Formulae
# brew 'bash-completion'
brew 'bash-completion2'
brew 'brew-cask-completion'
brew 'bundler-completion'
brew 'gem-completion'
brew 'pip-completion'
brew 'ruby-completion'
brew 'tmuxinator-completion'
brew 'zsh-completions'
